; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v10 ?v9)
             (pred_9 ?v11 ?v6)
             (pred_10 ?v10 ?v6)
             (pred_6 ?v2 ?v10 )
	     (pred_4 ?v10)
             (pred_12 ?v3)
             (pred_2 ?v11)
             (pred_11 ?v6)
             (pred_5 ?v10)
             (pred_8 ?v11)
             (pred_7 ?v10)
             (pred_1 ))



(:action op_5
:parameters (?v13 ?v5 ?v12 ?v7)
:precondition (and (pred_12 ?v13) (pred_12 ?v5) (pred_2 ?v12) (pred_11 ?v7)
          (pred_3 ?v13 ?v5) (pred_9 ?v12 ?v7)
                   (pred_10 ?v5 ?v7) (pred_4 ?v13) 
                   (pred_5 ?v5) (pred_8 ?v12))
:effect (and  (pred_7 ?v5) (not (pred_5 ?v5))))


(:action op_3
:parameters (?v13 ?v4)
:precondition (and (pred_12 ?v13) (pred_12 ?v4)
               (pred_4 ?v13) (pred_3 ?v13 ?v4) (pred_7 ?v4))
:effect (and (pred_4 ?v4) (not (pred_4 ?v13))))

(:action op_1
:parameters (?v13 ?v12)
:precondition (and (pred_12 ?v13) (pred_2 ?v12) 
                  (pred_4 ?v13) (pred_6 ?v12 ?v13) (pred_1 ))
:effect (and (pred_8 ?v12)
   (not (pred_6 ?v12 ?v13)) (not (pred_1 ))))


(:action op_2
:parameters (?v13 ?v8 ?v1)
:precondition (and (pred_12 ?v13) (pred_2 ?v8) (pred_2 ?v1)
                  (pred_4 ?v13) (pred_8 ?v1) (pred_6 ?v8 ?v13))
:effect (and (pred_8 ?v8) (pred_6 ?v1 ?v13)
        (not (pred_8 ?v1)) (not (pred_6 ?v8 ?v13))))

(:action op_4
:parameters (?v13 ?v12)
:precondition (and (pred_12 ?v13) (pred_2 ?v12) 
                  (pred_4 ?v13) (pred_8 ?v12))
:effect (and (pred_1 ) (pred_6 ?v12 ?v13) (not (pred_8 ?v12)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_05 obj_03 obj_04 obj_01 obj_07 obj_10 obj_02 obj_13
    obj_09 obj_06
    obj_08 obj_11
    )

    (:init
       (pred_1)

       (pred_12 obj_12)
       (pred_12 obj_05)
       (pred_12 obj_03)
       (pred_12 obj_04)
       (pred_12 obj_01)
       (pred_12 obj_07)
       (pred_12 obj_10)
       (pred_12 obj_02)
       (pred_12 obj_13)
       (pred_11 obj_09)
       (pred_11 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_11)

       (pred_3 obj_12 obj_04)
       (pred_3 obj_12 obj_05)
       (pred_3 obj_05 obj_01)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_05 obj_12)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_04 obj_10)
       (pred_3 obj_04 obj_01)
       (pred_3 obj_04 obj_12)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_01 obj_05)
       (pred_3 obj_01 obj_04)
       (pred_3 obj_07 obj_13)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_10 obj_04)
       (pred_3 obj_02 obj_13)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_13 obj_02)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_10  obj_12 obj_09)
       (pred_10  obj_01 obj_06)
       (pred_7 obj_05)
       (pred_7 obj_03)
       (pred_7 obj_04)
       (pred_7 obj_07)
       (pred_7 obj_10)
       (pred_7 obj_02)
       (pred_7 obj_13)

       (pred_9  obj_08 obj_09)
       (pred_9  obj_11 obj_06)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_11 obj_10)
       (pred_4 obj_02)
    )

    (:goal (and
       (pred_6 obj_08 obj_12)
    ))
(:constraints
  (always (not (pred_4 obj_04)))
)
)

; plan
1. (op_3 obj_02 obj_10)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_10)
   goals met: 0 of 1
2. (op_1 obj_10 obj_08)
   deleted: (pred_6 obj_08 obj_10) (pred_1)
   added: (pred_8 obj_08)
   goals met: 0 of 1
3. (op_3 obj_10 obj_02)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_02)
   goals met: 0 of 1
4. (op_3 obj_02 obj_13)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_13)
   goals met: 0 of 1
5. (op_3 obj_13 obj_07)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_07)
   goals met: 0 of 1
6. (op_3 obj_07 obj_03)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_03)
   goals met: 0 of 1
7. (op_3 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_05)
   goals met: 0 of 1
8. (op_5 obj_05 obj_12 obj_08 obj_09)
   deleted: (pred_5 obj_12)
   added: (pred_7 obj_12)
   goals met: 0 of 1
9. (op_3 obj_05 obj_12)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_12)
   goals met: 0 of 1
10. (op_4 obj_12 obj_08)
   deleted: (pred_8 obj_08)
   added: (pred_1) (pred_6 obj_08 obj_12)
   goals met: 1 of 1
